app/views/users/show.html.erb

SELECT "goals".* FROM "goals"
---
       <li class="divider"></li>
     <% exercise.goals.each do |goal| %>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 17]]
---
              <% end %>
              <p class="like-counter"><%= t.likes.count %></p>