app/controllers/goals_controller.rb

  def new
    @goal = Goal.new
    @category = Category.find_by_id(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @category = Category.find_by_id(params[:id])
    @goal = Goal.create(goal_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "goals" ("name", "deadline", "created_at", "updated_at", "accumulate") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["deadline", "2017-10-27 00:00:00"], ["created_at", "2017-10-27 23:32:49.703477"], ["updated_at", "2017-10-27 23:32:49.703477"], ["accumulate", "f"]]

  def show
    @category = Category.find_by_id(params[:category_id])
    @goal = Goal.find_by_id(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def delete_tracking
    @category = Category.find_by_id(params[:id])
    @goal = Goal.find_by_id(params[:id])
    @tracking = Tracking.find_by_id(params[:id])
    @tracking.destroy
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "trackings".* FROM "trackings" WHERE "trackings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "trackings" WHERE "trackings"."id" = $1  [["id", 5]]