app/controllers/trackings_controller.rb

  def new
    @tracking = Tracking.new
    @goal = Goal.find_by_id(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def create
    @goal = Goal.find_by_id(params[:id])
    @tracking = Tracking.create(tracking_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "trackings" ("time", "unit_of_measurement", "distance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["time", 860000], ["unit_of_measurement", "Seconds"], ["distance", 1200], ["created_at", "2017-10-26 20:29:40.157210"], ["updated_at", "2017-10-26 20:29:40.157210"]]

  def edit
    @goal = Goal.find_by_id(params[:goal_id])
    @tracking = Tracking.find_by_id(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "trackings".* FROM "trackings" WHERE "trackings"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def update
    @goal = Goal.find_by_id(params[:goal_id])
    @tracking = Tracking.find_by_id(params[:id])
    @tracking.update(tracking_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "trackings".* FROM "trackings" WHERE "trackings"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "trackings" SET "time" = $1, "distance" = $2, "updated_at" = $3 WHERE "trackings"."id" = $4  [["time", 12334251], ["distance", 1201], ["updated_at", "2017-10-27 01:48:44.390623"], ["id", 15]]