app/controllers/trackings_controller.rb

  def like
    type = params[:type]

    if type == "like" && !liked_tracking?(@tracking)
      current_user.liked << @tracking
      redirect_to user_feed_path(current_user), notice: 'You liked that post'
    elsif type == "unlike" && liked_tracking?(@tracking)
      current_user.liked.delete(@tracking)
---
INSERT INTO "likes" ("user_id", "tracking_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 17], ["tracking_id", 45], ["created_at", "2017-10-29 04:07:42.198654"], ["updated_at", "2017-10-29 04:07:42.198654"]]
DELETE FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."tracking_id" = 13  [["user_id", 17]]