app/controllers/users_controller.rb

  def show
    @goals = Goal.all
    @users = User.all
    @categories = @user.categories
    @trackings = Tracking.all
---
SELECT "goals".* FROM "goals"
SELECT "users".* FROM "users"
SELECT "trackings".* FROM "trackings"