app/controllers/users_controller.rb

  def category
    puts params
    @user = current_user
    @exercises = params[:exercise_type]
    @exercises.each do |exercise|
      @category = Category.new
      @category.user_id = current_user.id
      @category.name = exercise
      @user.categories << @category
---
INSERT INTO "categories" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 12], ["name", "Biking"], ["created_at", "2017-10-26 00:36:03.253868"], ["updated_at", "2017-10-26 00:36:03.253868"]]

  def follow
    @user = User.find_by_id(params[:id])
    type = params[:type]
    if type == "follow" && !following_user?
      @user.followers << current_user
      redirect_to user_path(@user), notice: 'You followed ' + @user.name

    elsif type == "unfollow" && following_user?
      current_user.followings.delete(@user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 17], ["LIMIT", 1]]
INSERT INTO "follows" ("following_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["following_id", 16], ["follower_id", 17], ["created_at", "2017-10-28 18:52:52.586905"], ["updated_at", "2017-10-28 18:52:52.586905"]]
DELETE FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."following_id" = 16  [["follower_id", 17]]

  def show
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]