app/views/goals/show.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
<div class="moveRight">
  <% if current_user == User.find_by_id(@goal.category.user_id) %>

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
                <% end %>
                <% if current_user == User.find_by_id(t.goal.category.user_id) %>

SELECT MAX("trackings"."distance") AS maximum_distance, EXTRACT(DOW from created_at::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer AS extract_dow_from_created_at_timestamptz_at_time_zone_etc_utc_in FROM "trackings" WHERE "trackings"."goal_id" = $1 AND (created_at IS NOT NULL) GROUP BY EXTRACT(DOW from created_at::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer  [["goal_id", 44]]
---
        <h3>Average</h3>
        <%= column_chart @tracking.group_by_day_of_week(:created_at, format: "%a").maximum(:distance), library: {chart: {backgroundColor: "transparent"}} %>