app/views/goals/show.html.erb

      <% if request.original_url =~ /^.*\/stats$/ %>
        <%= pie_chart @tracking.group([:time]).count, library: {chart: {backgroundColor: "transparent"}} %>
---
SELECT COUNT(*) AS count_all, EXTRACT(DOW from time::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer AS extract_dow_from_time_timestamptz_at_time_zone_etc_utc_interval FROM "goals" WHERE (time IS NOT NULL) GROUP BY EXTRACT(DOW from time::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer